{
    "instance": "main",
    "template": "article.show",
    "status": 200,
    "locale": "zh-CN",
    "data": {
        "article": {
            "lid": "yctanlxi",
            "title": "那场大雪撕裂了我的【】",
            "time": 1756571828,
            "author": {
                "uid": 1510406,
                "avatar": "https://cdn.luogu.com.cn/upload/usericon/1510406.png",
                "name": "FlowerRed",
                "slogan": "想不想看花海盛开？",
                "badge": null,
                "isAdmin": false,
                "isBanned": false,
                "color": "Red",
                "ccfLevel": 0,
                "xcpcLevel": 0,
                "background": "https://cdn.luogu.com.cn/upload/image_hosting/9liek18t.png"
            },
            "upvote": 304,
            "replyCount": 188,
            "favorCount": 146,
            "category": 7,
            "status": 2,
            "solutionFor": null,
            "promoteStatus": 0,
            "collection": null,
            "content": "本文致敬[《那场大雨淋碎了我的【】》](/article/5vn29ate)。阿凉姐姐 tql！\n\n叠甲：本文纯属虚构，作者没有 npy。\n\n:::align{center}\n### 零\n:::\n\n> 我青春的废墟上，始终覆盖着那场大雪。\n\n:::align{center}\n### 一\n:::\n\n“你看，”她指着屏幕上的树状数组，“每个下标都覆盖一个区间。”\n\n就像你覆盖了我全部的青春。\n\n雪落在校园的香樟树上，厚重的绿色托着纯白，偶尔有积雪从叶梢滑落，在窗外划出细微的轨迹。它们也落在机房窗沿，堆积成柔软的白色线条，将我们与外面的世界温柔地隔开。\n\n“这道题用树状数组比线段树更合适，”她继续说着，声音轻柔却清晰，“因为……”\n\n她的手指在键盘上轻盈地跳跃，代码如溪流般在屏幕上铺展开来。我看着她专注的侧脸，光线勾勒出她微微颤动的睫毛，那里偶尔会栖上一星从窗帘缝隙漏进来的光斑，随着她的眨眼明明灭灭。\n\n爱一个人，就像贪心算法，每一步都做出局部最优选择，却不知最终是否会导向全局最优解。我曾在无数个深夜思考这个问题，却始终不敢向她求证。\n\n她似乎察觉了我的走神，轻轻用笔戳了戳我的手背。\n\n“想什么呢？”她问，嘴角噙着一丝笑意。\n\n“在想……贪心。”我老实回答。\n\n“用贪心？这题不存在什么正确的贪心策略啊……”\n\n:::align{center}\n### 二\n:::\n\n窗外，北风呼啸着卷过空旷的操场，携着更多的雪花扑向窗玻璃。世界被简化成屏幕上的一行行代码，以及屏幕幽幽蓝光映照下，她侧脸柔和的轮廓。\n\n她重新转向屏幕，继续讲解着算法的实现细节。灯光下，我注意到她耳后一缕碎发随着她的动作轻轻晃动，注意到她卫衣袖口有些磨损的边缘，注意到她思考时会无意识地咬住下唇。这些细节如同代码中的注释，悄无声息地标注在我关于她的记忆里。\n\n时间悄然流逝，当我们终于 AC 了那道题，窗外已经彻底暗了下来，只有路灯在纷飞的雪片中撑开一团团昏黄的光晕。\n\n北风在窗外呼啸，机房却暖得像一个梦。一个 `while(1)` 的梦。\n\n直到，那个雪夜。\n\n:::align{center}\n### 三\n:::\n\n北风卷着雪花，像一场无声的入侵。我们并肩走出教学楼，路灯将我们的影子拉得很长，在雪地上交错。\n\n她突然停下脚步。\n\n“如果……”她的声音很轻，像雪落，“如果我说，我喜欢你呢？”\n\n那一刻，时间仿佛被冻结。雪花落在她的睫毛上，像缀满了星辰。她的话语在那一刻被封装成一个对象，被永久存储在我的内存空间中。\n\n:::align{center}\n### 四\n:::\n\n她的话音还未完全消散，像一片雪花悬停在寒冷的空气中。时间仿佛被无限拉长，那一瞬足够我看见她眼中映着的路灯微光，足够我数清她睫毛上凝结的冰晶，足够让那句“我喜欢你”在我心间反复回荡，编织出无数种可能的未来。\n\n然而时间终究是冷酷的算法，从不会为谁暂停执行。就在我张开嘴，试图组织回应的词语时——\n\n一道锋利的光骤然切开雪幕，伴随着轮胎徒然抓地的嘶鸣，像一道尖锐的异常错误刺穿了我们的世界。\n\n“砰——！”\n\n有什么东西碎了，或许是冰，或许是玻璃，或许……是这个世界。\n\n刺目的车灯如利刃划破雪幕，将整个世界切割得支离破碎。光线中飞舞的雪花变得慌乱而无序，像无数迷失方向的灵魂。\n\n她像一只断翅的蝶，在空中划过一道短暂而残酷的弧线，又如流星般坠落在苍白的雪地上。\n\n然后，是寂静。一种震耳欲聋的寂静。\n\n雪仍在落，温柔地覆盖上一切。一抹刺目的红，正从纯白中缓慢渗出。像早春不合时宜的花，寂静地开在雪地里。\n\n那红，烫伤了我的眼睛。\n\n:::align{center}\n### 五\n:::\n\n像一道无法被捕获的异常。像一段突然终止的线程。\n\n世界在那一瞬间被强制类型转换，从 `Beautiful` 到 `Tragic`，没有任何显式的类型检查，没有抛出任何警告。编译器沉默地通过了这段错误的代码，任由其运行，将我的宇宙彻底重构。\n\n白色。红色。白色。\n\n白色，是雪，是医院的墙壁，是护士服，是医生冷静到残酷的脸，是打印出来的病危通知单。\n\n红色，是血，是警示灯，是心电图最后那根刺眼的、趋于平直的线，是我眼底燃烧殆尽后的余烬。\n\n我站在那里，像一个僵死的子进程，失去了与主进程的所有联系，只剩下空洞的躯壳。逻辑，那个我曾无比信赖、用以构建和理解整个世界的基础，彻底崩塌了。`if-else` 全部断裂，`for` 循环意外 `break`，`while` 的条件永远无法再满足。\n\n输出是雪，是沉默，是银装素裹的废墟。\n\n像散落在雪地上的玻璃碎片，每一片都映照出那一刻被无限拉长、扭曲的残酷影像，再也无法拼凑完整。\n\n救护车的红色警灯无声闪烁，像宣告着我的 Wrong Answer。\n\n:::align{center}\n### 六\n:::\n\n医院长廊的灯光白得刺眼。它吞噬了所有颜色，将世界编译成绝望。消毒水的气味混合着冬夜渗入的寒气，每一次呼吸都像吸入碎玻璃，切割着肺叶和仅存的意识。\n\n时间在这里失去了线性的意义。只有心跳在胸腔里沉重地、徒劳地敲击，像一段陷入死循环的 `for (;;)`，每一次迭代都加载着更深的恐惧。\n\n那扇门，成了一个隔绝生死的界碑。每一次从内部传来的微弱脚步声，都像一次 `signal()`，让所有等待的线程瞬间被唤醒，旋即又陷入更深的 `wait()`。\n\n终于，门打开了。穿着白大褂的身影带着一身疲惫走了出来，口罩上方的眼睛里，承载着一种无需开口便已说明一切的沉重。她的家人像被惊醒的鸟群，瞬间围拢上去，每一双眼睛里都燃烧着最后一丝摇摇欲坠的火苗。\n\n“我们……尽力了。”\n\n寂静。不是无声的寂静，而是所有声音——骤起的悲鸣、压抑的抽噎、身体瘫软倒地的闷响——都被一个巨大的、名为“失去”的黑洞吸入后，所留下的、绝对的空无。\n\n我的世界，在那句话落下的瞬间，被彻底格式化，成了一片无声的荒原。\n\n:::align{center}\n### 七\n:::\n\n```cpp\nif (you.areHere()) {\n    return true;\n} else {\n    return false;\n}\n```\n\n总是返回 `false`。\n\n在最深的栈里，相望，相忘。那是我青春的全部回响。\n\n雪还在下。下在每个没有她的冬天。\n\n:::align{center}\n### 八\n:::\n\n我仍然参加比赛，仍然在刷题，仍然在写代码。但我知道，我的人生代码中，有一个函数永远返回 `false`，有一个模块永远缺失。\n\n有时候，在深夜的机房，我会对着屏幕发呆，仿佛还能听到她的笑声。“你看，”我对着空气说，“我学会了 LCT，学会了二项堆，学会了……”\n\n但沉默是唯一的回应。\n\n我的青春，被整齐地撕裂成两半。\n\n之前，是有她的时光，是充满确定性的代码和不确定的心事。\n\n之后，是无她的荒原，是所有程序都返回 CE，是所有记忆都触发 UB。\n\n后来我才明白，青春里真正惊天动地的告别，从来不是山崩地裂，而是在一个平常的雪天，有一个重要的人，消失在了雪里，再也没有回来。\n\n:::align{center}\n### 九\n:::\n\n我知道，她不可能再回来了。可我仍在等待。\n\n等待一场不会停的大雪。\n\n等待一个永远不会返回的递归。\n\n等待她归来，对我说——  \n\n“看，雪停了。”\n\n:::align{center}\n### 十\n:::\n\n那场大雪过后，\n\n我的青春，\n\nSegmentation Fault.\n\n---\n\n### 后记\n\n啊啊啊，我一个暑假在学校里集训了两个月都没放假、快要累死的 OIer，怎么还要军训啊！\n\n烦。\n\n军训期间没法上网，写的军训新闻稿刚刚成功在学校公众号上发表了的我，决定再写点什么东西。于是，这篇文章就诞生了。\n\n其实这些文字早就写完了，但原稿是拿笔和本子写的，军训结束（8.29）后才录成的电子版。~~所以，本来是打算七夕发的，没录完 qwq。~~\n\n第一次写这样的专栏，请各位语文课代表们轻喷喵。/bx",
            "contentFull": true,
            "adminNote": null
        },
        "favored": false,
        "voted": null,
        "canReply": false,
        "canEdit": false
    },
    "user": null,
    "time": 1766629667.370541,
    "theme": null
}